# Import Libraries

In [1]:
import pandas as pd
import numpy as np

# Generating a data set

In [2]:
data={'Name': ["Ali", "Majid", "Saqib", "Aslam", "Imran", "Elsa"],
     'Age':[13, 14, 17, 16, 14, 19],
     'Gender':['M', 'M', 'M', 'M', 'M', 'F'],
     'Marks': [90, 70, 59, 'NaN', 89, 'Nan']}

# Converting to data frame

In [3]:
df=pd.DataFrame(data)

In [4]:
df

    Name  Age Gender Marks
0    Ali   13      M    90
1  Majid   14      M    70
2  Saqib   17      M    59
3  Aslam   16      M   NaN
4  Imran   14      M    89
5   Elsa   19      F   Nan

# Data Assessment

In [11]:
df.dtypes

Name      object
Age        int64
Gender    object
Marks     object
dtype: object

In [13]:
df.shape

(6, 4)

In [16]:
df.head(2)

    Name  Age Gender Marks
0    Ali   13      M    90
1  Majid   14      M    70

In [17]:
df.tail(2)

    Name  Age Gender Marks
4  Imran   14      M    89
5   Elsa   19      F   Nan

In [21]:
df.sample()

    Name  Age Gender Marks
3  Aslam   16      M   NaN

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Age     6 non-null      int64
 2   Gender  6 non-null      object
 3   Marks   6 non-null      object
dtypes: int64(1), object(3)
memory usage: 320.0+ bytes

# Cleaning

In [26]:
new_df=df.replace('Nan', np.nan)

In [28]:
new_df

    Name  Age Gender Marks
0    Ali   13      M    90
1  Majid   14      M    70
2  Saqib   17      M    59
3  Aslam   16      M   NaN
4  Imran   14      M    89
5   Elsa   19      F   NaN

In [30]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Age     6 non-null      int64
 2   Gender  6 non-null      object
 3   Marks   5 non-null      object
dtypes: int64(1), object(3)
memory usage: 320.0+ bytes

# Now dealing with the missing value by taking the average of whole number

In [34]:
c=avg=0
for ele in df['Marks']:
    if str(ele).isnumeric():
        c+=1
        avg+=ele
avg /=c

# Replace Missing Value

In [40]:
df=df.replace(to_replace='NaN', value=avg)

In [41]:
df

    Name  Age Gender  Marks
0    Ali   13      M   90.0
1  Majid   14      M   70.0
2  Saqib   17      M   59.0
3  Aslam   16      M   77.0
4  Imran   14      M   89.0
5   Elsa   19      F   77.0

# Mean of Data

In [49]:
df.mean()      #mean off all columns

C:\Users\AL MADINA COMPUTER\AppData\Local\Temp\ipykernel_8188\2833669844.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()      #mean off all columns

Age      15.5
Marks    77.0
dtype: float64

In [50]:
df['Age'].mean()     #mean of one specific column

15.5

In [52]:
df[['Age', 'Marks']].mean()   #mean of more than one columns

Age      15.5
Marks    77.0
dtype: float64

In [54]:
df.mean(axis=1)    #mean by column or rows,   axis=1 represent rows and axis=0 represent columns

C:\Users\AL MADINA COMPUTER\AppData\Local\Temp\ipykernel_8188\3676274908.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean(axis=1)

0    51.5
1    42.0
2    38.0
3    46.5
4    51.5
5    48.0
dtype: float64

# Reshaping the data

In [56]:
df['Gender'].map({'M':0, 'F':1})          #represent te gender in 0 and 1 format

0    0
1    0
2    0
3    0
4    0
5    1
Name: Gender, dtype: int64

In [58]:
df['Gender']=df['Gender'].map({'M':0, 'F':1}).astype(float)

In [60]:
df.dtypes

Name       object
Age         int64
Gender    float64
Marks     float64
dtype: object

# Filtering

In [65]:
high_std=df[df['Marks']>=80]

In [68]:
high_std

    Name  Age  Gender  Marks
0    Ali   13     NaN   90.0
4  Imran   14     NaN   89.0

# Delet and Dropping Column

In [73]:
new_drop=df.drop(['Gender', 'Age'], axis=1)     #droping of columns

In [74]:
new_drop=df.drop([0,4], axis=0)       #dropping of rows

In [76]:
new_drop

    Name  Age  Gender  Marks
1  Majid   14     NaN   70.0
2  Saqib   17     NaN   59.0
3  Aslam   16     NaN   77.0
5   Elsa   19     NaN   77.0

# Creating a Series

In [79]:
ser=pd.Series()
print(ser)

Series([], dtype: float64)

C:\Users\AL MADINA COMPUTER\AppData\Local\Temp\ipykernel_8188\3268763758.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  ser=pd.Series()

In [81]:
data=np.array(['a', 'e', 'i', 'o', 'u'])

In [82]:
ser=pd.Series(data)

In [84]:
ser.dtypes

dtype('O')

# Creating a Data Frame

In [87]:
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [89]:
lst=['Data Frame', 'Is', 'A', 'Two', 'Dimensional', 'Data', 'Structure']

In [95]:
df=pd.DataFrame(lst)

In [98]:
print(df)

             0
0   Data Frame
1           Is
2            A
3          Two
4  Dimensional
5         Data
6    Structure

# Reading CSV file

In [ ]:
pd.read_csv("filename.csv")

# Reading Excel File

In [ ]:
pd.read_eexcel(r'filedirectory / Filename.xlsx')

# Read JSON File

In [ ]:
df=pd.read_json('data.json')
print(df.to_string())

In [ ]:
data={"JSON pattern}
df.pd.DataFrame(data)

# Read SQL Query

In [ ]:
imort pandas as pd     #importing pandas library
from sqlite3 import connect   #connecting with database
conn=connect("Stock.db")   #creting a database
data=pd.read_csv('Fb.csv')  
data.to_sql("meta".conn)
df=pd.read_sql("select*From meta LIMIT 5". conn)  #import pandas read_sql() method
print(df)
conn.close()    #closing of database